app/views/users/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 15]]
---
            <p class="fs-3 fw-bold text-primary mb-0">
              <%= @posts.sum { |post| post.comments.count } %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
---
          <p class="fs-3 fw-bold text-primary mb-0">
           <%= Comment.where(user_id: @user.id).count %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 15]]
---
              <i class="bi bi-chat-dots me-1"></i>
              <%= post.comments.count %> <%=t(:comments_show)%>