app/views/posts/_post.html.erb


          <% if post.tags.any? %>
---
SELECT 1 AS one FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1 LIMIT $2  [["post_id", 9], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 15]]

              <div>
                <% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 9]]


            <% if post.comments.any? %>
---
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 9], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 15]]

                          border-radius: 5px; padding: 10px;">
                <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 15]]