app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 15], ["message", "oi"], ["created_at", "2025-01-02 07:10:35.106619"], ["updated_at", "2025-01-02 07:10:35.106619"]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user if user_signed_in?

    if @comment.save