app/controllers/posts_controller.rb

SELECT COUNT(DISTINCT "posts"."id") FROM "posts" INNER JOIN "posts_tags" ON "posts_tags"."post_id" = "posts"."id" INNER JOIN "tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE (posts.title ILIKE $1 OR posts.content ILIKE $2 OR tags.name ILIKE $3)  [[nil, "%fast%"], [nil, "%fast%"], [nil, "%fast%"]]
SELECT DISTINCT "posts".* FROM "posts" INNER JOIN "posts_tags" ON "posts_tags"."post_id" = "posts"."id" INNER JOIN "tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE (posts.title ILIKE $1 OR posts.content ILIKE $2 OR tags.name ILIKE $3) ORDER BY "posts"."created_at" DESC LIMIT $4 OFFSET $5  [[nil, "%fast%"], [nil, "%fast%"], [nil, "%fast%"], ["LIMIT", 3], ["OFFSET", 0]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT 1 AS one FROM "posts" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    if params[:search].present?
      # Buscando posts com tags customizadas
      @posts = Post.joins(:tags)
                   .where("posts.title ILIKE ? OR posts.content ILIKE ? OR tags.name ILIKE ?",
                          "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")
                   .distinct
                   .order(created_at: :desc) # Ordena os posts por data de criação em ordem decrescente
                   .page(params[:page]).per(3)
    elsif params[:tag].present?
      # Filtro por tag específica
      @posts = Post.joins(:tags)
                   .where("tags.name ILIKE ?", params[:tag])
                   .order(created_at: :desc) # Ordena os posts por data de criação em ordem decrescente
                   .page(params[:page]).per(3)
    else
      # Exibe todos os posts
      @posts = Post.all
                   .order(created_at: :desc) # Ordena os posts por data de criação em ordem decrescente
                   .page(params[:page]).per(3)

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "test"], ["created_at", "2024-12-31 17:05:55.152209"], ["updated_at", "2024-12-31 17:05:55.152209"], ["user_id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 AND "tags"."post_id" = $2 LIMIT $3  [["name", "test"], ["post_id", 10], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["created_at", "2024-12-31 17:05:55.182818"], ["updated_at", "2024-12-31 17:05:55.182818"], ["post_id", 10]]
SELECT 1 AS one FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1 AND "tags"."id" = $2 LIMIT $3  [["post_id", 10], ["id", 12], ["LIMIT", 1]]
---
  def create
    if current_user.nil?
      respond_to do |format|
        format.html { redirect_to root_path, alert: "Apenas usuários logados podem criar post." }
        format.json { render json: { error: "Apenas usuários logados podem criar post." }, status: :unauthorized }
      end
      return
    end

    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
        # Verificando se as tags estão presentes e associando ao post
        if params[:post][:tags].present?
          custom_tags = params[:post][:tags].split(",").map(&:strip).uniq
          custom_tags.each do |tag_name|
            tag = Tag.find_or_create_by(name: tag_name, post_id: @post.id)
            @post.tags << tag unless @post.tags.include?(tag)

UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Título atualizado"], ["content", "Conteúdo atualizado"], ["updated_at", "2025-01-03 03:04:20.411966"], ["id", 15]]
---
  def update
    unless user_signed_in?
      respond_to do |format|
        format.html { redirect_to root_path, alert: "Apenas usuários logados podem atualizar posts." }
        format.json { render json: { error: "Apenas usuários logados podem atualizar post." }, status: :unauthorized }
      end
      return
    end

    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 14]]
---
  def destroy
    @post.destroy!