app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = @user.posts.order(created_at: :desc).page(params[:page]).per(3)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2 OFFSET $3) subquery_for_count  [["user_id", 1], ["LIMIT", 3], ["OFFSET", 0]]