app/jobs/upload_processor_job.rb

  def perform(file_path, user_id)
    user = User.find(user_id)
    Rails.logger.info "Tentando abrir o arquivo: #{file_path}"

    # Verifique se o arquivo realmente existe antes de tentar processá-lo
    if File.exist?(file_path)
      Rails.logger.info "Arquivo encontrado, processando..."

      # Processar o arquivo linha por linha
      File.readlines(file_path).each do |line|
        # Espera-se o formato: título | conteúdo | tags separadas por vírgula
        title, content, tags = line.strip.split("|")
        next unless title.present? && content.present?

        tags = tags.present? ? tags.split(",").map(&:strip) : []

        ActiveRecord::Base.transaction do
          # Cria o post associado ao usuário
          post = Post.create!(title: title.strip, content: content.strip, user: user)

          # Cria as tags e associa ao post
          tags.each do |tag_name|
            tag = Tag.find_or_create_by!(name: tag_name)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "FASTER"], ["content", "This is the content of my FASTER post"], ["created_at", "2025-01-03 02:36:16.067260"], ["updated_at", "2025-01-03 02:36:16.067260"], ["user_id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "tag1"], ["created_at", "2024-12-31 23:54:23.711781"], ["updated_at", "2024-12-31 23:54:23.711781"], ["post_id", nil]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "fast"], ["LIMIT", 1]]